konstantin-dzreev/bare-metal-rp2350-riscv/include/hardware/regs/hstx_ctrl.inc
#               data command. A register value of 0 means shift 32 times.
.equ	HSTX_CTRL_EXPAND_SHIFT_RAW_N_SHIFTS_RESET, 0x01
.equ	HSTX_CTRL_EXPAND_SHIFT_RAW_N_SHIFTS_BITS, 0x00001f00
.equ	HSTX_CTRL_EXPAND_SHIFT_RAW_N_SHIFTS_MSB, 12
.equ	HSTX_CTRL_EXPAND_SHIFT_RAW_N_SHIFTS_LSB, 8
# -----------------------------------------------------------------------------
# Field       : HSTX_CTRL_EXPAND_SHIFT_RAW_SHIFT
# Description : How many bits to right-rotate the shift register by each time
#               data is pushed to the output shifter, when the current command
#               is a raw data command.
.equ	HSTX_CTRL_EXPAND_SHIFT_RAW_SHIFT_RESET, 0x00
.equ	HSTX_CTRL_EXPAND_SHIFT_RAW_SHIFT_BITS, 0x0000001f
.equ	HSTX_CTRL_EXPAND_SHIFT_RAW_SHIFT_MSB, 4
.equ	HSTX_CTRL_EXPAND_SHIFT_RAW_SHIFT_LSB, 0
# =============================================================================
# Register    : HSTX_CTRL_EXPAND_TMDS
# Description : Configure the optional TMDS encoder inside the command expander
.equ	HSTX_CTRL_EXPAND_TMDS_OFFSET, 0x00000028
.equ	HSTX_CTRL_EXPAND_TMDS_BITS, 0x00ffffff
.equ	HSTX_CTRL_EXPAND_TMDS_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : HSTX_CTRL_EXPAND_TMDS_L2_NBITS
# Description : Number of valid data bits for the lane 2 TMDS encoder, starting
#               from bit 7 of the rotated data. Field values of 0 -> 7 encode
#               counts of 1 -> 8 bits.
.equ	HSTX_CTRL_EXPAND_TMDS_L2_NBITS_RESET, 0x0
.equ	HSTX_CTRL_EXPAND_TMDS_L2_NBITS_BITS, 0x00e00000
.equ	HSTX_CTRL_EXPAND_TMDS_L2_NBITS_MSB, 23
.equ	HSTX_CTRL_EXPAND_TMDS_L2_NBITS_LSB, 21
# -----------------------------------------------------------------------------
# Field       : HSTX_CTRL_EXPAND_TMDS_L2_ROT
# Description : Right-rotate applied to the current shifter data before the
#               lane 2 TMDS encoder.
.equ	HSTX_CTRL_EXPAND_TMDS_L2_ROT_RESET, 0x00
.equ	HSTX_CTRL_EXPAND_TMDS_L2_ROT_BITS, 0x001f0000
.equ	HSTX_CTRL_EXPAND_TMDS_L2_ROT_MSB, 20
.equ	HSTX_CTRL_EXPAND_TMDS_L2_ROT_LSB, 16
# -----------------------------------------------------------------------------
# Field       : HSTX_CTRL_EXPAND_TMDS_L1_NBITS
# Description : Number of valid data bits for the lane 1 TMDS encoder, starting
#               from bit 7 of the rotated data. Field values of 0 -> 7 encode
#               counts of 1 -> 8 bits.
.equ	HSTX_CTRL_EXPAND_TMDS_L1_NBITS_RESET, 0x0
.equ	HSTX_CTRL_EXPAND_TMDS_L1_NBITS_BITS, 0x0000e000
.equ	HSTX_CTRL_EXPAND_TMDS_L1_NBITS_MSB, 15
.equ	HSTX_CTRL_EXPAND_TMDS_L1_NBITS_LSB, 13
# -----------------------------------------------------------------------------
# Field       : HSTX_CTRL_EXPAND_TMDS_L1_ROT
# Description : Right-rotate applied to the current shifter data before the
#               lane 1 TMDS encoder.
.equ	HSTX_CTRL_EXPAND_TMDS_L1_ROT_RESET, 0x00
.equ	HSTX_CTRL_EXPAND_TMDS_L1_ROT_BITS, 0x00001f00
.equ	HSTX_CTRL_EXPAND_TMDS_L1_ROT_MSB, 12
.equ	HSTX_CTRL_EXPAND_TMDS_L1_ROT_LSB, 8
# -----------------------------------------------------------------------------
# Field       : HSTX_CTRL_EXPAND_TMDS_L0_NBITS
# Description : Number of valid data bits for the lane 0 TMDS encoder, starting
#               from bit 7 of the rotated data. Field values of 0 -> 7 encode
#               counts of 1 -> 8 bits.
.equ	HSTX_CTRL_EXPAND_TMDS_L0_NBITS_RESET, 0x0
.equ	HSTX_CTRL_EXPAND_TMDS_L0_NBITS_BITS, 0x000000e0
.equ	HSTX_CTRL_EXPAND_TMDS_L0_NBITS_MSB, 7
.equ	HSTX_CTRL_EXPAND_TMDS_L0_NBITS_LSB, 5
# -----------------------------------------------------------------------------
# Field       : HSTX_CTRL_EXPAND_TMDS_L0_ROT
# Description : Right-rotate applied to the current shifter data before the
#               lane 0 TMDS encoder.
.equ	HSTX_CTRL_EXPAND_TMDS_L0_ROT_RESET, 0x00
.equ	HSTX_CTRL_EXPAND_TMDS_L0_ROT_BITS, 0x0000001f
.equ	HSTX_CTRL_EXPAND_TMDS_L0_ROT_MSB, 4
.equ	HSTX_CTRL_EXPAND_TMDS_L0_ROT_LSB, 0
# =============================================================================
.endif # _HARDWARE_REGS_HSTX_CTRL_H
